# coding=utf-8
from pandas import DataFrame

# refarence: http://ailaby.com/lox_iloc_ix/

df = DataFrame([[1, 2, 3],
                [10, 20, 30],
                [100, 200, 300],
                [1000, 2000, 3000]],
               index=['row_0', 'row_1', 'row_2', 'row_3'],
               columns=['col_0', 'col_1', 'col_2'])

# loc
# loc は 行、列をラベルで指定します。

print (df)
# -----------------------------
#        col_0  col_1  col_2
# row_0      1      2      3
# row_1     10     20     30
# row_2    100    200    300
# row_3   1000   2000   3000
# -----------------------------


# 行ラベルを指定

print(df.loc[['row_2', 'row_3']])
# ----------------------------
#        col_0  col_1  col_2
# row_2    100    200    300
# row_3   1000   2000   3000
# ----------------------------

# 列ラベルを指定

print(df.loc[:, ['col_1', 'col_2']])

# ---------------------------
#        col_1  col_2
# row_0      2      3
# row_1     20     30
# row_2    200    300
# row_3   2000   3000
# ---------------------------


# 行と列ラベルを指定

print(df.loc[['row_2', 'row_3'], ['col_1', 'col_2']])

# ---------------------------
#        col_1  col_2
# row_2    200    300
# row_3   2000   3000
# ---------------------------


# boolean で指定

print(df.loc[[False, False, True, True], [False, True, True]])
# ---------------------------
#        col_1  col_2
# row_2    200    300
# row_3   2000   3000
# ---------------------------


# iloc
# iloc は 行、列を番号で指定します（先頭が 0）。

# 行番号を指定

print(df.iloc[[2, 3]])

# ----------------------------
#        col_0  col_1  col_2
# row_2    100    200    300
# row_3   1000   2000   3000
# ----------------------------


# 列番号を指定

print(df.iloc[:, [1, 2]])
# ----------------------------
#        col_1  col_2
# row_0      2      3
# row_1     20     30
# row_2    200    300
# row_3   2000   3000
# ----------------------------


# 行、列番号を指定


print(df.iloc[[2, 3], [1, 2]])
# ----------------------------
#        col_1  col_2
# row_2    200    300
# row_3   2000   3000
# ----------------------------


# 行、列番号をスライスで指定


print(df.iloc[2:4, 1:3])
# ----------------------------
#        col_1  col_2
# row_2    200    300
# row_3   2000   3000
# ----------------------------


# boolean で指定


print(df.iloc[[False, False, True, True], [False, True, True]])
# ----------------------------
#        col_1  col_2
# row_2    200    300
# row_3   2000   3000
# ----------------------------
